Интенсивное_обучение_программированию/src/InformationRegisters/ЧасоваяСтавкаСотрудника/ЧасоваяСтавкаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЧасоваяСтавкаСотрудника</name>
  <comment>Часовая ставка сотрудника</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ЧасоваяСтавка</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Интенсивное_обучение_программированию/src/InformationRegisters/ЧасоваяСтавкаСотрудника/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЧасовуюСтавку(СотрудникОтбора, ПериодОтбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЧасоваяСтавкаСотрудникаСрезПоследних.ЧасоваяСтавка
		|ИЗ
		|	РегистрСведений.ЧасоваяСтавкаСотрудника.СрезПоследних(&ПериодСреза, Сотрудник = &Сотрудник) КАК
		|		ЧасоваяСтавкаСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("ПериодСреза", ПериодОтбора);
	Запрос.УстановитьПараметр("Сотрудник", СотрудникОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
		Если РезультатЗапроса.Пустой() Тогда
			
			ЧасоваяСтавкаСотрудника = 0;
			
		Иначе
				
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();				
			ВыборкаДетальныеЗаписи.Следующий();
			ЧасоваяСтавкаСотрудника = ВыборкаДетальныеЗаписи.ЧасоваяСтавка;
							
		КонецЕсли;
	
	Возврат ЧасоваяСтавкаСотрудника;
	
КонецФункции

#КонецОбласти
